Autodesk.Revit.DB.StartingViewSettings.IsAcceptableStartingView(Autodesk.Revit.DB.ElementId)
Checks whether the given Id is an acceptable starting view.  InvalidElementId corresponds to "Last Viewed" and is therefore also acceptable.
Remarks:
Model views (such as plans, ceiling plans, sections, elevations, and 3d views) are acceptable.
In addition, drafting views, sheets, legends, schedules, and graphical column schedules are generally acceptable.
Special views such as the project browser, system navigator, reports, revision schedules, internal schedules,
sheets that are not actually in use, and views that belong to a family are not acceptable.
viewId:
The Id of the element to check.
Returns:
True if the view is acceptable, False if it is not.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.StartingViewSettings.GetStartingViewSettings(Autodesk.Revit.DB.Document)
Returns the starting view settings for the specified document.
doc:
The document to get the settings from, which must be a project document.
Returns:
The starting view settings for the document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
doc is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.StartingViewSettings.ViewId
Indicates the specific view that will be opened when the model is loaded.  InvalidElementId indicates
that no view has been specified.  In that case, Revit will open the last views that were open at the
time the file was saved.
Remarks:
Note that InvalidElementId will cause Revit to open the same view it would have used
in Revit 2011 and prior releases.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: viewId is not an acceptable starting view for this model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012